In [2]:
import pandas as pd

In [3]:
#讀excel
df_orderData = pd.read_excel('訂單test.xlsx', sheet_name = 0)
df_orderData1 = pd.read_excel('訂單test.xlsx', sheet_name = 1)

In [4]:
df = pd.DataFrame(df_orderData,columns=['OEB01','OEB03','OEB15','OEB16','OEA02','OEA14'])
df

                OEB01  OEB03      OEB15      OEB16      OEA02  OEA14
0    TT531-1804050001      1  05-APR-18  05-APR-18  05-APR-18  T0412
1    TT531-1804050001      2  05-APR-18  05-APR-18  05-APR-18  T0412
2    TT531-1804050001      3  05-APR-18  05-APR-18  05-APR-18  T0412
3    TT531-1804050001      4  05-APR-18  05-APR-18  05-APR-18  T0412
4    TT531-1804050001      5  05-APR-18  05-APR-18  05-APR-18  T0412
..                ...    ...        ...        ...        ...    ...
426  TT531-1804160001      1  14-MAY-18  22-MAY-18  16-APR-18  T0215
427  TT531-1804270001      1  13-JUN-18  11-JUN-18  27-APR-18  T0437
428  TT531-1804270001      2  13-JUN-18  15-JUN-18  27-APR-18  T0437
429  TT531-1804270001      3  13-JUN-18  30-MAY-18  27-APR-18  T0437
430  TT531-1804270001      4  13-JUN-18  06-JUN-18  27-APR-18  T0437

[431 rows x 6 columns]

In [5]:
df["pk"] = df["OEB01"] + "_" + df["OEB03"].map(str)
df

,OEB01,OEB03,OEB15,OEB16,OEA02,OEA14,pk
0,TT531-1804050001,1,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_1
1,TT531-1804050001,2,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_2
2,TT531-1804050001,3,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_3
3,TT531-1804050001,4,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_4
4,TT531-1804050001,5,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_5
...,...,...,...,...,...,...,...
426,TT531-1804160001,1,14-MAY-18,22-MAY-18,16-APR-18,T0215,TT531-1804160001_1
427,TT531-1804270001,1,13-JUN-18,11-JUN-18,27-APR-18,T0437,TT531-1804270001_1
428,TT531-1804270001,2,13-JUN-18,15-JUN-18,27-APR-18,T0437,TT531-1804270001_2
429,TT531-1804270001,3,13-JUN-18,30-MAY-18,27-APR-18,T0437,TT531-1804270001_3
430,TT531-1804270001,4,13-JUN-18,06-JUN-18,27-APR-18,T0437,TT531-1804270001_4

In [6]:
df1 = pd.DataFrame(df_orderData1,columns=['OEB01','OEB03','OEB15','OEB16','OEA02','OEA14'])
df1

                OEB01  OEB03      OEB15      OEB16      OEA02  OEA14
0    TT531-1804050001      1  05-APR-18  05-APR-18  05-APR-18  T0412
1    TT531-1804050001      2  05-APR-18  05-APR-18  05-APR-18  T0412
2    TT531-1804050001      3  05-APR-18  05-APR-18  05-APR-18  T0412
3    TT531-1804050001      4  05-APR-18  05-APR-18  05-APR-18  T0412
4    TT531-1804050001      5  05-APR-18  05-APR-18  05-APR-18  T0412
..                ...    ...        ...        ...        ...    ...
426  TT531-1804160001      1  14-MAY-18  22-MAY-18  16-APR-18  T0215
427  TT531-1804270001      1  13-JUN-18  11-JUN-18  27-APR-18  T0437
428  TT531-1804270001      2  13-JUN-18  15-JUN-18  27-APR-18  T0437
429  TT531-1804270001      3  13-JUN-18  30-MAY-18  27-APR-18  T0437
430  TT531-1804270001      4  13-JUN-18  06-JUN-18  27-APR-18  T0437

[431 rows x 6 columns]

In [7]:
df1["pk"] = df1["OEB01"] + "_" + df1["OEB03"].map(str)
df1

,OEB01,OEB03,OEB15,OEB16,OEA02,OEA14,pk
0,TT531-1804050001,1,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_1
1,TT531-1804050001,2,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_2
2,TT531-1804050001,3,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_3
3,TT531-1804050001,4,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_4
4,TT531-1804050001,5,05-APR-18,05-APR-18,05-APR-18,T0412,TT531-1804050001_5
...,...,...,...,...,...,...,...
426,TT531-1804160001,1,14-MAY-18,22-MAY-18,16-APR-18,T0215,TT531-1804160001_1
427,TT531-1804270001,1,13-JUN-18,11-JUN-18,27-APR-18,T0437,TT531-1804270001_1
428,TT531-1804270001,2,13-JUN-18,15-JUN-18,27-APR-18,T0437,TT531-1804270001_2
429,TT531-1804270001,3,13-JUN-18,30-MAY-18,27-APR-18,T0437,TT531-1804270001_3
430,TT531-1804270001,4,13-JUN-18,06-JUN-18,27-APR-18,T0437,TT531-1804270001_4

In [11]:
tmp = df.append(df1)
tmp.drop_duplicates(keep=False, inplace=True)
df2=pd.DataFrame(tmp)
df2

Empty DataFrame
Columns: [OEB01, OEB03, OEB15, OEB16, OEA02, OEA14, pk]
Index: []

In [12]:
last = df2.drop_duplicates(subset=['pk'],keep='last')
last

Empty DataFrame
Columns: [OEB01, OEB03, OEB15, OEB16, OEA02, OEA14, pk]
Index: []

In [13]:
first = df2.drop_duplicates(subset=['pk'],keep='first')
first

Empty DataFrame
Columns: [OEB01, OEB03, OEB15, OEB16, OEA02, OEA14, pk]
Index: []

In [14]:
dupl = df2.drop_duplicates(subset=['pk'],keep=False)
dupl

Empty DataFrame
Columns: [OEB01, OEB03, OEB15, OEB16, OEA02, OEA14, pk]
Index: []

In [15]:
new = last.append(dupl).drop_duplicates(subset=['pk'],keep=False)
#new.set_index("pk",inplace=True)
new

Empty DataFrame
Columns: [OEB01, OEB03, OEB15, OEB16, OEA02, OEA14, pk]
Index: []

In [16]:
old = first.append(dupl).drop_duplicates(subset=['pk'],keep=False)
#old.set_index("pk",inplace=True)
old

Empty DataFrame
Columns: [OEB01, OEB03, OEB15, OEB16, OEA02, OEA14, pk]
Index: []

In [17]:
final = new.merge(old,on = ['pk','OEB01','OEB03','OEB15','OEA02','OEA14'], suffixes=('_new','_old') )
final = final[['OEA14','OEA02','OEB01','OEB03','OEB15','OEB16_old','OEB16_new']]
final.sort_values('OEA14')
final.rename(columns={'OEA02': '訂單日期', 'OEA14': '業務編號', 'OEB01': '訂單號碼', 'OEB03': '項次', 'OEB15': '約定交貨日', 'OEB16_old': '原排定交貨日', 'OEB16_new': '新排定交貨日'}, inplace=True)
final

Empty DataFrame
Columns: [業務編號, 訂單日期, 訂單號碼, 項次, 約定交貨日, 原排定交貨日, 新排定交貨日]
Index: []

In [18]:
#dataframe轉html
df_html = final.to_html(escape=False,index=False, justify = 'center')

In [19]:
from email.mime.multipart import MIMEMultipart
from email.mime.text import MIMEText#專門傳送正文
from email.mime.image import MIMEImage
import sys
import smtplib
import datetime

def SendMail():
    #print('start to send mail...')
    sender = "hl94vul3h6@gmail.com" #step1:setup sender gmail,ex:"Fene1977@superrito.com"
    password = "eeecnzvlhavhksyb" #step2:setup sender gmail password
    recipients = "ytluo693@gmail.com" #step3:setup recipients mail
    today = datetime.date.today()
    sub = today.strftime("%m/%d") + "訂單交期更改通知" #step4:setup your subject
    
    #單個收件人,ex:recipients = 'Fene1977@dayrep.com'  
    #多個收件人,ex:"Hinte1969@jourrapide.com,Fene1977@rhyta.com,Fene1977@teleworm.us"
    
    outer = MIMEMultipart()
    outer['From'] = sender #step:setup sender gmail
    outer['To'] = recipients #step:setup recipient mail
    #outer["Cc"]="cc mail" #step:setup cc mail
    outer['Subject'] = sub #step:setup your subject

    #設定純文字資訊
    plainText = "偵測到訂單排定交貨日更改，請確認附件之訂單："
    msgText = MIMEText(plainText, 'plain', 'utf-8')
    outer.attach(msgText)
    #設定HTML資訊
    htmlText = df_html #step7:edit your mail content
    msgText = MIMEText(htmlText, 'html', 'utf-8')
    outer.attach(msgText)

    mailBody = outer.as_string()
    #-----------------------------------------------------------------------
    
    # 寄送EMAIL
    try:
        with smtplib.SMTP(host="smtp.gmail.com", port="587") as s: #send webservice to gmail smtp socket
            s.ehlo()  # 驗證SMTP伺服器
            s.starttls()  # 建立加密傳輸
            s.login(sender, password)  # 登入寄件者gmail
            s.sendmail(sender, recipients,mailBody)  # 寄送郵件
            s.close()
        print("Email sent!")
    except:
        print("Unable to send the email. Error: ", sys.exc_info()[0])
        raise
        
if old.equals(new):
    print("未更改")
else:
    SendMail()
    print("交期已被更改")

未更改

In [11]:
def read_file(file):
    with open(file,'r') as f:
            content_list = f.read()
    return content_list
recipients = read_file('收件人.txt')
recipients

'ytluo693@gmail.com'